[
    {
        "date": "Apr 26, 2024",
        "text": "Reminder: Technical report submission deadline approaching. Ensure timely completion.",
        "link": "#"
    },
    {
        "date": "Apr 30, 2024",
        "text": "Online classes according to Academic Routine of Saturday will be conducted on Tuesday.",
        "link": "#"
    },
    {
        "date": "Apr 27, 2024",
        "text": "Attention students: Classes suspended from 3 PM today due to faculty seminar.",
        "link": "#"
    },
    {
        "date": "May 3, 2024",
        "text": "Reminder: Don't forget to submit your final presentation outline by the end of the week.",
        "link": "#"
    },
    {
        "date": "May 8, 2024",
        "text": "Join us for a special seminar on the ethical implications of artificial intelligence technologies next Tuesday.",
        "link": "#"
    },
    {
        "date": "May 15, 2024",
        "text": "Attention all students: The deadline for submitting your research papers has been extended to May 20.",
        "link": "#"
    },
    {
        "date": "May 20, 2024",
        "text": "The final exam schedule for the current semester has been officially released. Please check your emails for details.",
        "link": "#"
    },
    {
        "date": "May 25, 2024",
        "text": "Applications for summer internships are now open. Don't miss this opportunity to gain valuable experience!",
        "link": "#"
    },
    {
        "date": "May 30, 2024",
        "text": "Welcome to all new students! Orientation sessions will be held next week to help you get acquainted with campus life.",
        "link": "#"
    },
    {
        "date": "Jun 5, 2024",
        "text": "Save the date! The graduation ceremony for the class of 2024 will take place on June 5th at the university stadium.",
        "link": "#"
    },
    {
        "date": "Jun 10, 2024",
        "text": "Faculty members, please mark your calendars for the upcoming faculty meeting scheduled for June 10.",
        "link": "#"
    },
    {
        "date": "Jun 15, 2024",
        "text": "Enjoy your summer break! Classes for the next semester will resume in September. Have a wonderful vacation!",
        "link": "#"
    },
    {
        "date": "Jun 20, 2024",
        "text": "Registration for courses in the upcoming fall semester will open on June 20. Plan your schedule accordingly.",
        "link": "#"
    }
]
